//  3. ✅ Методи перебору масивів (forEach, filter, map, findIndex, *some, *every):
// 3.1. Отримати новий масив із заданого, який міститиме лише ненульові числа
//        (-1, 5, 0, 9, -10 => -1, 5, 9, -10).
// 3.2. Отримати новий масив їх заданого, який міститиме всі елементи вихідного, поділені на 100
//        (99, 5, 0, 9, 30 => 0.99, 0.05, 0, 0.09, 0.3).
// 3.3. Вивести елементи масиву, зведені у куб.
// 3.4. Визначити індекс елемента, квадрат якого дорівнює 100, і видалити його, або видати діагностичне повідомлення, якщо такого елементу не існує.
// 3.4. Знайти в масиві перше число, яке є більшим за 50. Вивести це число в консоль. Якщо такого числа немає — вивести undefined.

// ❗SPOILER❗ 3.1 - filter, 3.2 - map, 3.3 - forEach, 3.4 - findIndex, 3.5 - find.

const arrs = [-1, 5, 0, 9, -10];

function nonZeroNums(numbers) {
  return numbers !== 0;
}

const arrNonZeros = arrs.filter(nonZeroNums);
console.log("arrNonZero  :>> ", arrNonZeros);
